pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_cache.h
/*
 * Copyright (c) 2019 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_CACHE_H__
#define NRF_CACHE_H__

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_cache_hal CACHE HAL
 * @{
 * @ingroup nrf_cache
 * @brief   The hardware access layer for managing the CACHE peripheral.
 */

#if defined(CACHEDATA_SET_WAY_DU_DATA_Data_Msk) || defined(CACHEDATA_SET_WAY_DATA0_Data_Msk) || \
    defined(__NRFX_DOXYGEN__)
/** @brief Presence of the CACHEDATA feature. */
#define NRF_CACHE_HAS_CACHEDATA 1
#else
#define NRF_CACHE_HAS_CACHEDATA 0
#endif

#if defined(CACHEDATA_SET_WAY_DU_DATA_Data_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Presence of the CACHE data units feature. */
#define NRF_CACHE_HAS_CACHEDATA_DU 1
#else
#define NRF_CACHE_HAS_CACHEDATA_DU 0
#endif

#if defined(CACHEINFO_SET_WAY_INFO_TAG_Msk) || defined(CACHEINFO_SET_WAY_TAG_Msk) || \
    defined(__NRFX_DOXYGEN__)
/** @brief Presence of the CACHEINFO feature. */
#define NRF_CACHE_HAS_CACHEINFO 1
#else
#define NRF_CACHE_HAS_CACHEINFO 0
#endif

#if defined(CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether cache tasks are supported. */
#define NRF_CACHE_HAS_TASKS 1
#else
#define NRF_CACHE_HAS_TASKS 0
#endif

#if defined(CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether the CLEAN cache/line tasks are supported. */
#define NRF_CACHE_HAS_TASK_CLEAN 1
#else
#define NRF_CACHE_HAS_TASK_CLEAN 0
#endif

#if defined(CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether the FLUSH cache/line tasks are supported. */
#define NRF_CACHE_HAS_TASK_FLUSH 1
#else
#define NRF_CACHE_HAS_TASK_FLUSH 0
#endif

#if defined(CACHE_TASKS_SAVE_TASKS_SAVE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether save and restore tasks are supported. */
#define NRF_CACHE_HAS_TASK_SAVE_RESTORE 1
#else
#define NRF_CACHE_HAS_TASK_SAVE_RESTORE 0
#endif

#if defined(CACHE_STATUS_READY_Msk) || defined(CACHE_STATUS_BUSY_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether status check is supported. */
#define NRF_CACHE_HAS_STATUS 1
#else
#define NRF_CACHE_HAS_STATUS 0
#endif

#if defined(CACHE_MODE_MODE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether splitting the dedicated RAM between cache and generic memory is supported. */
#define NRF_CACHE_HAS_RAM_MODE 1
#else
#define NRF_CACHE_HAS_RAM_MODE 0
#endif

#if defined(CACHE_MODE_RAMSIZE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether configuration of split of dedicated RAM between cache and generic memory is supported. */
#define NRF_CACHE_HAS_RAMSIZE 1
#else
#define NRF_CACHE_HAS_RAMSIZE 0
#endif

#if defined(CACHEINFO_SET_WAY_D0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether dirtiness check functionality for cache is supported. */
#define NRF_CACHE_HAS_CACHEINFO_DU_DIRTY 1
#else
#define NRF_CACHE_HAS_CACHEINFO_DU_DIRTY 0
#endif

#if defined(CACHEINFO_SET_WAY_DUV0_Msk) || defined(CACHEINFO_SET_WAY_INFO_DUV0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether data unit validation functionality for cache is supported. */
#define NRF_CACHE_HAS_CACHEINFO_DU_VALIDATION 1
#else
#define NRF_CACHE_HAS_CACHEINFO_DU_VALIDATION 0
#endif

#if defined(CACHEINFO_SET_WAY_INFO_DUV0_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether cache info has INFO register. */
#define NRF_CACHE_HAS_CACHEINFO_SET_WAY_INFO 1
#else
#define NRF_CACHE_HAS_CACHEINFO_SET_WAY_INFO 0
#endif

#if NRF_CACHE_HAS_CACHEDATA
/** @brief Max number of words in CACHEDATA data units. */
#define NRF_CACHEDATA_DATA_WORDS_IN_UNIT_MAX CACHEDATA_SET_WAY_DU_DATA_MaxCount
/** @brief Max number of CACHEDATA data units. */
#define NRF_CACHEDATA_DATA_UNITS_MAX CACHEDATA_SET_WAY_DU_MaxCount
/** @brief Max number of CACHEDATA words. */
#define NRF_CACHEDATA_WORD_INDEX_MAX \
        (NRF_CACHEDATA_DATA_WORDS_IN_UNIT_MAX * NRF_CACHEDATA_DATA_UNITS_MAX)
/** @brief Max number of CACHEDATA ways. */
#define NRF_CACHEDATA_WAY_INDEX_MAX  CACHEDATA_SET_WAY_MaxCount
/** @brief Max number of CACHEDATA sets. */
#define NRF_CACHEDATA_SET_INDEX_MAX  CACHEDATA_SET_MaxCount
#endif

#if NRF_CACHE_HAS_CACHEINFO
/** @brief Max number of words in CACHEINFO data units. */
#define NRF_CACHEINFO_DATA_WORDS_IN_UNIT_MAX CACHEDATA_SET_WAY_DU_DATA_MaxCount
/** @brief Max number of CACHEINFO data units. */
#define NRF_CACHEINFO_DATA_UNITS_MAX CACHEDATA_SET_WAY_DU_MaxCount
/** @brief Max number of CACHEINFO words. */
#define NRF_CACHEINFO_WORD_INDEX_MAX \
        (NRF_CACHEINFO_DATA_WORDS_IN_UNIT_MAX * NRF_CACHEINFO_DATA_UNITS_MAX)
/** @brief Max number of CACHEINFO ways. */
#define NRF_CACHEINFO_WAY_INDEX_MAX  CACHEINFO_SET_WAY_MaxCount
/** @brief Max number of CACHEINFO sets. */
#define NRF_CACHEINFO_SET_INDEX_MAX  CACHEINFO_SET_MaxCount
#endif

#if NRF_CACHE_HAS_RAMSIZE
/** @brief Max enumerator value of RAMSIZE field. */
#define NRF_CACHE_MODE_RAMSIZE_MAX CACHE_MODE_RAMSIZE_Max
#endif

