pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_cache.h
NRF_STATIC_INLINE uint32_t nrf_cache_data_miss_counter_get(NRF_CACHE_Type const * p_reg,
                                                           nrf_cache_region_t     region)
{
#if defined(CACHE_PROFILING_DMISS_MISSES_Msk)
    return p_reg->PROFILING[region].DMISS;
#elif defined(CACHE_PROFILING_MISS_MISSES_Msk)
    (void)region;
    return p_reg->PROFILING.MISS;
#endif
}

#if NRF_CACHE_HAS_RAM_MODE
NRF_STATIC_INLINE void nrf_cache_ram_mode_set(NRF_CACHE_Type * p_reg, bool enable)
{
    p_reg->MODE = ((p_reg->MODE & ~CACHE_MODE_MODE_Msk) |
                   ((enable ? CACHE_MODE_MODE_Ram : CACHE_MODE_MODE_Cache)
                   << CACHE_MODE_MODE_Pos));
}

NRF_STATIC_INLINE bool nrf_cache_ram_mode_check(NRF_CACHE_Type const * p_reg)
{
    return (p_reg->MODE & CACHE_MODE_MODE_Msk) == (CACHE_MODE_MODE_Ram << CACHE_MODE_MODE_Pos);
}
#endif

#if NRF_CACHE_HAS_RAMSIZE
NRF_STATIC_INLINE void nrf_cache_ramsize_set(NRF_CACHE_Type * p_reg, nrf_cache_ramsize_t ramsize)
{
    p_reg->MODE = ((p_reg->MODE & ~CACHE_MODE_RAMSIZE_Msk) | (ramsize << CACHE_MODE_RAMSIZE_Pos));
}

NRF_STATIC_INLINE nrf_cache_ramsize_t nrf_cache_ramsize_get(NRF_CACHE_Type const * p_reg)
{
    return (nrf_cache_ramsize_t)((p_reg->MODE & CACHE_MODE_RAMSIZE_Msk) >> CACHE_MODE_RAMSIZE_Pos);
}
#endif

NRF_STATIC_INLINE void nrf_cache_read_lock_enable(NRF_CACHE_Type * p_reg)
{
    p_reg->DEBUGLOCK = CACHE_DEBUGLOCK_DEBUGLOCK_Locked;
}

NRF_STATIC_INLINE void nrf_cache_update_lock_set(NRF_CACHE_Type * p_reg, bool enable)
{
    p_reg->WRITELOCK =
        (enable ? CACHE_WRITELOCK_WRITELOCK_Locked : CACHE_WRITELOCK_WRITELOCK_Unlocked);
}

#if NRF_CACHE_HAS_CACHEDATA
NRF_STATIC_INLINE uint32_t nrf_cache_data_get(NRF_CACHEDATA_Type const * p_reg,
                                              uint32_t                   set,
                                              uint8_t                    way,
                                              uint8_t                    word)
{
#if NRF_CACHE_HAS_CACHEDATA_DU
    NRFX_ASSERT(word < NRF_CACHEDATA_WORD_INDEX_MAX);
    NRFX_ASSERT(way < NRF_CACHEDATA_WAY_INDEX_MAX);
    NRFX_ASSERT(set < NRF_CACHEDATA_SET_INDEX_MAX);

    uint8_t du   = (word / NRF_CACHEDATA_DATA_WORDS_IN_UNIT_MAX);
    uint8_t data = (uint8_t)(word - (du * NRF_CACHEDATA_DATA_WORDS_IN_UNIT_MAX));

    return p_reg->SET[set].WAY[way].DU[du].DATA[data];
#else
    volatile CACHEDATA_SET_WAY_Type const * reg = &p_reg->SET[set].WAY[way];
    switch (word)
    {
        case 0: return reg->DATA0;
        case 1: return reg->DATA1;
        case 2: return reg->DATA2;
        case 3: return reg->DATA3;
        default:
            NRFX_ASSERT(false);
            return 0;
    }
#endif
}
#endif

#if NRF_CACHE_HAS_CACHEINFO
NRF_STATIC_INLINE uint32_t nrf_cache_tag_get(NRF_CACHEINFO_Type const * p_reg,
                                             uint32_t                   set,
                                             uint8_t                    way)
{
#if defined(CACHEINFO_SET_WAY_INFO_TAG_Msk)
    NRFX_ASSERT(way < NRF_CACHEINFO_WAY_INDEX_MAX);
    NRFX_ASSERT(set < NRF_CACHEINFO_SET_INDEX_MAX);
    return (p_reg->SET[set].WAY[way].INFO & CACHEINFO_SET_WAY_INFO_TAG_Msk);
#else
    return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_TAG_Msk);
#endif
}

NRF_STATIC_INLINE bool nrf_cache_line_validity_check(NRF_CACHEINFO_Type const * p_reg,
                                                     uint32_t                   set,
                                                     uint8_t                    way)
{
#if defined(CACHEINFO_SET_WAY_INFO_V_Msk)
    NRFX_ASSERT(way < NRF_CACHEINFO_WAY_INDEX_MAX);
    NRFX_ASSERT(set < NRF_CACHEINFO_SET_INDEX_MAX);
    return (p_reg->SET[set].WAY[way].INFO & CACHEINFO_SET_WAY_INFO_V_Msk) ==
        (CACHEINFO_SET_WAY_INFO_V_Valid << CACHEINFO_SET_WAY_INFO_V_Pos);
#else
    return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_V_Msk) ==
        (CACHEINFO_SET_WAY_V_Valid << CACHEINFO_SET_WAY_V_Pos);
#endif
}

NRF_STATIC_INLINE uint8_t nrf_cache_mru_get(NRF_CACHEINFO_Type const * p_reg, uint32_t set)
{
#if defined(CACHEINFO_SET_WAY_INFO_MRU_Pos)
    NRFX_ASSERT(set < NRF_CACHEINFO_SET_INDEX_MAX);
    return ((p_reg->SET[set].WAY[0].INFO & CACHEINFO_SET_WAY_INFO_MRU_Msk) >>
        CACHEINFO_SET_WAY_INFO_MRU_Pos);
#else
    return ((p_reg->SET[set].WAY[0] & CACHEINFO_SET_WAY_MRU_Msk) >> CACHEINFO_SET_WAY_MRU_Pos);
#endif
}

#if NRF_CACHE_HAS_CACHEINFO_DU_VALIDATION
NRF_STATIC_INLINE bool nrf_cache_data_unit_validity_check(NRF_CACHEINFO_Type const * p_reg,
                                                          uint32_t                   set,
                                                          uint8_t                    way,
                                                          uint8_t                    word)
{
    NRFX_ASSERT(word < NRF_CACHEINFO_WORD_INDEX_MAX);
    NRFX_ASSERT(way < NRF_CACHEINFO_WAY_INDEX_MAX);
    NRFX_ASSERT(set < NRF_CACHEINFO_SET_INDEX_MAX);

    uint8_t du = (word / NRF_CACHEINFO_DATA_WORDS_IN_UNIT_MAX);
    switch (du)
    {
#if NRF_CACHE_HAS_CACHEINFO_SET_WAY_INFO
        case 0:
            return (p_reg->SET[set].WAY[way].INFO &
                    CACHEINFO_SET_WAY_INFO_DUV0_Msk) ==
                   (CACHEINFO_SET_WAY_INFO_DUV0_Valid << CACHEINFO_SET_WAY_INFO_DUV0_Pos);
        case 1:
            return (p_reg->SET[set].WAY[way].INFO &
                    CACHEINFO_SET_WAY_INFO_DUV1_Msk) ==
                   (CACHEINFO_SET_WAY_INFO_DUV1_Valid << CACHEINFO_SET_WAY_INFO_DUV1_Pos);
        case 2:
            return (p_reg->SET[set].WAY[way].INFO &
                    CACHEINFO_SET_WAY_INFO_DUV2_Msk) ==
                   (CACHEINFO_SET_WAY_INFO_DUV2_Valid << CACHEINFO_SET_WAY_INFO_DUV2_Pos);
        case 3:
            return (p_reg->SET[set].WAY[way].INFO &
                    CACHEINFO_SET_WAY_INFO_DUV3_Msk) ==
                   (CACHEINFO_SET_WAY_INFO_DUV3_Valid << CACHEINFO_SET_WAY_INFO_DUV3_Pos);
#else
        case 0:
            return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_DUV0_Msk) ==
                   (CACHEINFO_SET_WAY_DUV0_Valid << CACHEINFO_SET_WAY_DUV0_Pos);
        case 1:
            return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_DUV1_Msk) ==
                   (CACHEINFO_SET_WAY_DUV1_Valid << CACHEINFO_SET_WAY_DUV1_Pos);
        case 2:
            return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_DUV2_Msk) ==
                   (CACHEINFO_SET_WAY_DUV2_Valid << CACHEINFO_SET_WAY_DUV2_Pos);
        case 3:
            return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_DUV3_Msk) ==
                   (CACHEINFO_SET_WAY_DUV3_Valid << CACHEINFO_SET_WAY_DUV3_Pos);
#endif
        default:
            NRFX_ASSERT(false);
            return false;
    }
}
#endif // NRF_CACHE_HAS_CACHEINFO_DU_VALIDATION

#if NRF_CACHE_HAS_CACHEINFO_DU_DIRTY
NRF_STATIC_INLINE bool nrf_cache_is_data_unit_dirty_check(NRF_CACHEINFO_Type const * p_reg,
                                                          uint32_t                   set,
                                                          uint8_t                    way,
                                                          uint8_t                    word)
{
    NRFX_ASSERT(word < NRF_CACHEINFO_WORD_INDEX_MAX);
    NRFX_ASSERT(way < NRF_CACHEINFO_WAY_INDEX_MAX);
    NRFX_ASSERT(set < NRF_CACHEINFO_SET_INDEX_MAX);

