pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_cache.h
    uint8_t du = (word / NRF_CACHEINFO_DATA_WORDS_IN_UNIT_MAX);
    switch (du)
    {
        case 0:
            /* FALLTHROUGH */
        case 1:
            return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_D0_Msk) ==
                (CACHEINFO_SET_WAY_D0_Dirty << CACHEINFO_SET_WAY_D0_Pos);
        case 2:
            /* FALLTHROUGH */
        case 3:
            return (p_reg->SET[set].WAY[way] & CACHEINFO_SET_WAY_D1_Msk) ==
                (CACHEINFO_SET_WAY_D1_Dirty << CACHEINFO_SET_WAY_D1_Pos);
        default:
            NRFX_ASSERT(false);
            return false;
    }
}
#endif
#endif // NRF_CACHE_HAS_CACHEINFO

#if NRF_CACHE_HAS_TASKS
NRF_STATIC_INLINE void nrf_cache_lineaddr_set(NRF_CACHE_Type * p_reg, uint32_t addr)
{
    p_reg->LINEADDR = addr;
}

NRF_STATIC_INLINE uint32_t nrf_cache_lineaddr_get(NRF_CACHE_Type const * p_reg)
{
    return p_reg->LINEADDR;
}

NRF_STATIC_INLINE void nrf_cache_task_trigger(NRF_CACHE_Type * p_reg, nrf_cache_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

NRF_STATIC_INLINE uint32_t nrf_cache_task_address_get(NRF_CACHE_Type const * p_reg,
                                                      nrf_cache_task_t       task)
{
    return (uint32_t)p_reg + (uint32_t)task;
}
#endif

#if NRF_CACHE_HAS_STATUS
NRF_STATIC_INLINE bool nrf_cache_busy_check(NRF_CACHE_Type const * p_reg)
{
#if defined(CACHE_STATUS_READY_Msk)
    return (p_reg->STATUS & CACHE_STATUS_READY_Msk) ==
        (CACHE_STATUS_READY_Busy << CACHE_STATUS_READY_Pos);
#else
    return (p_reg->STATUS & CACHE_STATUS_BUSY_Msk) ==
        (CACHE_STATUS_BUSY_Busy << CACHE_STATUS_BUSY_Pos);
#endif
}
#endif

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_CACHE_H__
